lendrik-kumar/radcom/firmware/node/sdkconfig.defaults
# sdkconfig.defaults — radcom node (ESP32-C3)
# Applied automatically by idf.py. Overrides IDF defaults without menuconfig.

# ── Target ────────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32c3"

# ── USB CDC serial (no UART adapter needed) ───────────────────────────────────
CONFIG_ESP_CONSOLE_USB_CDC=y
CONFIG_ESP_CONSOLE_USB_CDC_SUPPORT_ETS_PRINTF=y

# ── Logging ───────────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# For RF bringup: change to CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y

# ── WiFi SoftAP ───────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# ── HTTP server / WebSocket ───────────────────────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HTTPD_MAX_OPEN_SOCKETS=15

# ── SPI ───────────────────────────────────────────────────────────────────────
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# ── FreeRTOS ──────────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# ── Task watchdog ─────────────────────────────────────────────────────────────
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# ── NVS ───────────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n
